PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.h
/***************************************************************************//**
* \file cy_graphics.h
* \version 1.0
*
* This file provides constants and parameter values for the APIs provided
* by Graphics Sub system.
*
********************************************************************************
* \copyright
* Copyright 2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
*******************************************************************************/

/**
* \addtogroup group_graphics           GFXSS        (Graphics Sub System)
* \{
*
* The Graphics Sub System driver provides an application interface
* for configuring graphics IP.
*
* GFXSS features graphics rendering to memory and control of one display:
* - Vector Graphics and Blit Operations.
* - Rendering fill rate up to 200Mpix/s.
* - MIPI-DSI displays with DPI (pixel interface) or DBI Type B (bus interface).
* - GPIO displays with parallel or serial interface (DPI and all DBI types).
* - Display modes up to 1024 x 768 pixels @ 60 Hz (64 MHz) with 24-bit color resolution.
*
* Graphics Processing Unit (GPU):
* - Display list command processing.
* - 2D geometry processing with perspective correction and no depth coordinate (=2.5D).
* - Tessellation of line, quad and Bezier curve primitives.
* - Vector graphics rasterization for linear and curved paths.
* - Textured, solid and linear fill pattern.
* - 8 Porter Duff blending modes.
* - Various ARGB formats for textures and destination buffers (8, 16 or 32 bpp).
* - Color palette for textures (1, 2, 4 or 8 index bpp).
* - Chroma sub-sampled destination buffers (YUV 4:2:2 or 4:2:0 with 16 or 12 bpp).
*
* Display Controller (DC):
* - 3 display layers with transparency (alpha blending).
* - 2 layers with support for YUV up-sampling.
* - 1 layer with support for RLAD decompression.
* - Cursor overlay.
* - Gamma correction.
* - Color keying.
* - Spatial dithering.
* - Various ARGB formats (16 or 32 bpp).
* - Various YUV formats, packed and semi-planar (12 or 16 bpp).
* - Video Timing Generator for DPI displays.
* - Configuration and Frame Buffer update for DBI displays (DCS write only).
*
* MIPI-DSI Host Controller and D-PHY (MIPIDSI)
* - DPI-2 and and DBI-2 Type B displays.
* - Up to 2 data lanes, max 1.5 Gbps per lane.
* - PLL for high-speed mode clock generation.
* - Generic command interface (DCS and proprietary read & write).
* - Video Pattern generator.
* - Ultra-Low-Power mode with disabled PLL.
* - Tearing Effect interrupt for DBI displays.
* - Shutdown and Color Mode control for DPI displays.

* The functions and other declarations used in this driver are in cy_graphics.h.
* You can include cy_pdl.h to get access to all functions
* and declarations in the PDL.
*
* \section group_graphics_section_more_information More Information
*
* For more information on the Graphics subsystem, refer to the technical reference
* manual (TRM).
*
* \section group_graphics_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial Driver.</td>
*     <td>Initial Driver.</td>
*   </tr>
*   </tr>
* </table>
*
* \defgroup group_graphics_macros Macros
* \defgroup group_graphics_functions Functions
* \defgroup group_graphics_data_structures Data Structures
* \defgroup group_graphics_enums Enumerated Types
*/

#if !defined (CY_GRAPHICS_H)
#define CY_GRAPHICS_H

#include "cy_device.h"

#if defined (CY_IP_MXS22GFXSS)

#include "viv_dc_type.h"
#include "viv_dc_util.h"
#include "viv_dc_setting.h"
#include "cy_syspm.h"
#include "cy_mipidsi.h"
#include "cy_syslib.h"
#include "viv_dc_hardware.h"
#include "vg_lite.h"

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_graphics_macros
* \{
*/

/** Graphics driver identifier */
#define CY_GRAPHICS_ID                                   (CY_PDL_DRV_ID(0x4DU))

/** Driver major version */
#define CY_GRAPHICS_DRV_VERSION_MAJOR                    1

/** Driver minor version */
#define CY_GRAPHICS_DRV_VERSION_MINOR                    0

/** DBI slice limit in bytes*/
#define DBI_SCLICE_LIMIT_IN_BYTES                        65536

/** Output pixel format in bytes*/
#define RGB_16_BIT_PIXEL_FORMAT_IN_BYTES                 2

/** Pixel format in bytes*/
#define RGB_32_BIT_PIXEL_FORMAT_IN_BYTES                 4

/** Pointer to dc core*/
#define DC_CORE                                          dcCore

/** Pointer to dc core*/
extern viv_dc_core *dcCore;

/** Interrupt status mask for CORE interrupt */
#define GFXSS_DC_INTR_CORE_MASK                         (0x00001)

/** Interrupt status mask for reading from ADDR0 completed */
#define GFXSS_DC_INTR_ADDR0_MASK                        (0x00100)

/** Interrupt status mask for reading from ADDR0 completed */
#define GFXSS_DC_INTR_ADDR1_MASK                        (0x00200)

/** Interrupt status mask for reading from ADDR0 completed */
#define GFXSS_DC_INTR_ADDR2_MASK                        (0x00400)

/** Interrupt status mask for reading from ADDR0 completed */
#define GFXSS_DC_INTR_ADDR3_MASK                        (0x00800)

/** Interrupt status mask for RLAD Decoder error */
#define GFXSS_DC_INTR_RLAD_ERROR_MASK                   (0x10000)

/**
* \defgroup group_graphics_macros_intrupter_macros Interrupt Mask
* \{
*/

/** Display0 interrupt*/
#define GFXSS_DC_DISP0_INT_MASK           GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_DISP0_Msk
/** Display0 DBI configure error*/
#define GFXSS_DC_DISP0_DBI_CFG_ERROR_MASK GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_DISP0_DBI_CFG_ERROR_Msk
/** Panel underflow intr*/
#define GFXSS_DC_PANEL_UNDERFLOW_MASK     GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_PANEL_UNDERFLOW_Msk
/** Soft reset done*/
#define GFXSS_DC_SOFT_RESET_DONE_MASK     GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_SOFT_RESET_DONE_Msk
/** Bus error*/
#define GFXSS_DC_BUS_ERROR_MASK           GFXSS_DC_DCNANO_GCREGDISPLAYINTRENABLE_GCREGDISPLAYINTRENABLE_BUS_ERROR_Msk

