PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.h
/** \} group_graphics_macros_intr_macros */

/** \} group_graphics_macros */

/*******************************************************************************
*       Enumerated Types
*******************************************************************************/

/**
* \addtogroup group_graphics_enums
* \{
*/

/** Graphics API result */
typedef enum
{
    CY_GFX_SUCCESS,          /**< Success */
    CY_GFX_BAD_PARAM,        /**< Bad parameter */
    CY_GFX_TIMEOUT,          /**< Operation timeout */
} cy_en_gfx_status_t;

/** RLAD image format */
typedef enum
{
    CY_GFX_RLAD_FMT_ARGB4444,
    CY_GFX_RLAD_FMT_ARGB1555,
    CY_GFX_RLAD_FMT_RGB565,
    CY_GFX_RLAD_FMT_ARGB8888,
    CY_GFX_RLAD_FMT_RGB888,
    CY_GFX_RLAD_FMT_RGB666,
    CY_GFX_RLAD_FMT_RGB444,
    CY_GFX_RLAD_FMT_GRAY8,
    CY_GFX_RLAD_FMT_GRAY6,
    CY_GFX_RLAD_FMT_GRAY4
} cy_en_gfx_rlad_fmt_t;

/** RLAD decoder status */
typedef enum
{
    CY_GFX_RLAD_NORMAL_OPERATION,   /**< No fail state or Normal Operation. */
    CY_GFX_RLAD_AXI_ERROR,          /**< An AXI error response was received when reading compressed image data. */
    CY_GFX_RLAD_BUF_TOO_SMALL,      /**< The RLAD_SIZE setting is inconsistent with the compressed image data (image decompression not complete when end of buffer was reached). */
    CY_GFX_RLAD_BUF_TOO_LARGE,      /**< The RLAD_SIZE setting is inconsistent with the compressed image data (image decompression completed before end of buffer was reached). */
    CY_GFX_RLAD_DC_INVALID_SIZE,    /**< The DC was reading the first pixel of a frame when it was not expected. This means an inconsistent setup of RLAD and DC configuration. */
    CY_GFX_RLAD_DC_INVALID_FORMAT   /**< The DC was reading data with an unexpected burst length. This means an invalid buffer format was configured. */
} cy_en_gfx_rlad_status_t;

/** RLAD compression mode */
typedef enum
{
    CY_GFX_RLAD_MODE_RLAD,          /**< 'Run Length Adaptive Dithering' compression. It is a lossless image compression type. */
    CY_GFX_RLAD_MODE_RLAD_UNIFORM,  /**< 'Run Length Adaptive Dithering' compression with uniform bits per pixel. It is a lossless image compression type. */
    CY_GFX_RLAD_MODE_RLA,           /**< 'Run Length Adaptive' compression. It is a lossless image compression type. */
    CY_GFX_RLAD_MODE_RL             /**< 'Run length Encoded' compression. It is a lossless image compression type. */
} cy_en_gfx_rlad_comp_mode_t;

/** Layer type */
typedef enum
{
    GFX_LAYER_GRAPHICS,
    GFX_LAYER_OVERLAY0,
    GFX_LAYER_OVERLAY1,
} cy_en_gfx_layer_type_t;

/** Display type */
typedef enum
{
    GFX_DISP_TYPE_DPI,
    GFX_DISP_TYPE_DBI_A,
    GFX_DISP_TYPE_DBI_B,
    GFX_DISP_TYPE_DBI_C,
    GFX_DISP_TYPE_DSI_DBI,
    GFX_DISP_TYPE_DSI_DPI
} cy_en_gfx_display_type_t;

/** Display format type */
typedef enum
{
    /* DPI */
    GFX_DPI_D24,
    GFX_DPI_D16CFG1,
    GFX_DPI_D16CFG2,
    GFX_DPI_D16CFG3,
    GFX_DPI_D18CFG1,
    GFXSS_DPI_D18CFG2,

    /* DBI */
    GFX_DBI_D8R3G3B2,
    GFX_DBI_D8R4G4B4,
    GFX_DBI_D8R5G6B5,
    GFX_DBI_D8R6G6B6,
    GFX_DBI_D8R8G8B8,
    GFX_DBI_D9R6G6B6,
    GFX_DBI_D16R3G3B2,
    GFX_DBI_D16R4G4B4,
    GFX_DBI_D16R5G6B5,
    GFX_DBI_D16R6G6B6OP1,
    GFX_DBI_D16R6G6B6OP2,
    GFX_DBI_D16R8G8B8OP1,
    GFX_DBI_D16R8G8B8OP2,
    GFX_DBI_D1R5G6B5,
    GFX_DBI_D1R8G8B8,
} cy_en_gfx_display_format_t;

/** Display buffer update type */
typedef enum
{
    GFX_SINGLE_BUFFER,
    GFX_DOUBLE_BUFFER,
    GFX_SPLIT_BUFFER,
} cy_en_gfx_disp_buffer_update_type_t;

/** \} group_graphics_enums */


/*******************************************************************************
*      Types definition
*******************************************************************************/

/**
* \addtogroup group_graphics_data_structures
* \{
*/

/** Cursor Configuration */
typedef struct
{
    uint32_t *image_address;              /**< Cursor image address */
    uint8_t  hotspot_x;                   /**< Cursor hotspot x location */
    uint8_t  hotspot_y;                   /**< Cursor hotspot y location */
    uint16_t pos_x;                       /**< Cursor position x location */
    uint16_t pos_y;                       /**< Cursor position y location */
    uint32_t bgcolor;                     /**< Cursor background colour */
    uint32_t fgcolor;                     /**< Cursor foreground colour */
    bool     enable;                      /**<  Layer state */
} cy_stc_gfx_cursor_config_t;


/** RLAD configuration structure */
typedef struct
{
    cy_en_gfx_layer_type_t      layer_id;                  /**<  Layer ID*/
    uint32_t                    image_width;               /**<  Width of the image in number of pixels minus one. */
    uint32_t                    image_height;              /**<  Height of the image in number of pixels minus one */
    uint32_t                    compressed_image_size;     /**<  Size of the the encoded image in number of 32-bit words minus one. Defined in image header file.*/
    uint32_t                    *image_address;            /**<  Image address */
    cy_en_gfx_rlad_comp_mode_t  compression_mode;          /**<  RLAD compression mode */
    cy_en_gfx_rlad_fmt_t        rlad_format;               /**<  RLAD display format */
    bool                        enable;                    /**<  Layer state */
} cy_stc_gfx_rlad_cfg_t;

/** GPU configuration structure. Reserved for future use. */
typedef struct
{
    bool enable;   /**<  GPU  status */
} cy_stc_gfx_gpu_cfg_t;

/** GPU context */
typedef struct
{
    /** \cond INTERNAL */

    bool enabled;             /**< vglite initialization status */
    uint32_t ts_width;        /**< tessellation width */
    uint32_t ts_height;       /**< tessellation height */
    bool vg_lite_initialised; /**< vg_Lite initialisation status */

    /** \endcond */
} cy_stc_gfx_gpu_context_t;

/** Layer Configuration structure */
typedef struct
{
    cy_en_gfx_layer_type_t  layer_type;            /**< Layer type */
    gctADDRESS              *buffer_address;       /**< Buffer */
    gctADDRESS              *uv_buffer_address;    /**< UV Buffer */
    viv_input_format_type   input_format_type;     /**< Inout format */
    viv_tiling_type         tiling_type;           /**< Tiliing format */
    viv_layer_alpha_mode    alpha_mode;            /**< Alpha mode */
    gctUINT32               pos_x;                 /**< Position X */
    gctUINT32               pos_y;                 /**< Position Y */
    gctUINT32               width;                 /**< Width */
    gctUINT32               height;                /**< Height */
    gctUINT8                zorder;                /**< Z Order */
    gctBOOL                 layer_enable;          /**< Layer status */

} cy_stc_gfx_layer_config_t;

/** Display controller Configuration */
typedef struct
{
    cy_stc_gfx_layer_config_t       *gfx_layer_config;     /**< Graphics/Video Layer configuration */
    cy_stc_gfx_layer_config_t       *ovl0_layer_config;    /**< Overlay0 Layer configuration */
    cy_stc_gfx_layer_config_t       *ovl1_layer_config;    /**< Overlay1 Layer configuration */
    cy_stc_gfx_rlad_cfg_t           *rlad_config;          /**< RLAD configuration */
    cy_stc_gfx_cursor_config_t      *cursor_config;        /**< Cursor configuration */
    cy_en_gfx_display_type_t        display_type;          /**< Display type */
    viv_display_format_type         display_format;        /**< Display format */
    viv_display_size_type           display_size;          /**< Display size */
    uint32_t                        display_width;         /**< Display width */
    uint32_t                        display_height;        /**< Display height */
    /** Interrupt mask refer to \ref group_graphics_macros_intrupter_macros */
    uint32_t                        interrupt_mask;
} cy_stc_gfx_dc_config_t;

/** Display controller context */
typedef struct
{
    /** \cond INTERNAL */

    cy_stc_gfx_layer_config_t       gfx_layer_config;     /**< Graphics/Video Layer configuration */
    cy_stc_gfx_layer_config_t       ovl0_layer_config;    /**< Overlay0 Layer configuration */
    cy_stc_gfx_layer_config_t       ovl1_layer_config;    /**< Overlay1 Layer configuration */
    cy_stc_gfx_rlad_cfg_t           rlad_config;          /**< RLAD configuration */
    cy_stc_gfx_cursor_config_t      cursor_config;        /**< Cursor configuration */
    cy_en_gfx_display_type_t        display_type;          /**< Display type */
    viv_display_format_type         display_format;        /**< Display format */
    viv_display_size_type           display_size;          /**< Display size */
    uint32_t                        display_width;         /**< Display width */
    uint32_t                        display_height;         /**< Display height */
    uint32_t                        interrupt_mask;        /**< Interrupt mask */

    /** \endcond */
} cy_stc_gfx_dc_context_t;

/** Graphics Block Configuration */
typedef struct
{
    cy_stc_gfx_dc_config_t                   *dc_cfg;             /**< Display controller configuration */
    cy_stc_gfx_gpu_cfg_t                     *gpu_cfg;            /**< GPU configuration is optional */
    cy_stc_mipidsi_config_t                  *mipi_dsi_cfg;       /**< MIPI DSI configuration */
    cy_en_gfx_disp_buffer_update_type_t      display_update_type; /**< Single / Dual / Split */
    uint32_t clockHz;     /**< The frequency of the clock connected to the GFXSS block in Hz. */
} cy_stc_gfx_config_t;

/** The Graphics internal context data. The user must not modify it. */
typedef struct
{
    /** \cond INTERNAL */

    cy_stc_mipidsi_context_t     mipidsi_context;     /**< MIPI DSI context */
    cy_stc_gfx_dc_context_t      dc_context;             /**< Display controller configuration */
    cy_stc_gfx_gpu_context_t     gpu_context;            /**< GPU configuration is optional */

