PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.h
    uint32_t clockHz;     /**< The frequency of the clock connected to the GFXSS block in Hz. */

    /** \endcond */
} cy_stc_gfx_context_t;
/** \} group_graphics_data_structures */


/*******************************************************************************
*    Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_graphics_functions
*  Following section describes the functions available in graphics subsystem.
*  For GPU specific functions,Please refer to <a href="vglite.pdf"> VGLite API Reference Manual </a>
*
*  Display controller functionality is taken care with high level graphics API implementation.
*  If user is looking for any specific functionality using direct display controller API directly,
*  please refer to <a href="dpu_api.pdf"> DPU API reference guide </a>
* \{
*/

/*******************************************************************************
* Function Name: Cy_GFXSS_Init
****************************************************************************//**
*
* Initializes graphics pipeline
*
* \param base
* Pointer to the graphics sub system base address.
*
* \param config
* Pointer to the pin config structure base address.
*
* \param context
* context information used by the driver.
*
* \return
* Initialization status.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Init(GFXSS_Type *base, cy_stc_gfx_config_t *config, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_SleepCallback
****************************************************************************//**
*
* Sleep callback implementation for graphics sub system.
*
* \param *callbackParams
*     A \ref cy_stc_syspm_callback_params_t structure with callback
*     parameters that consists of mode, base and context fields:
*    *base - a graphics register structure pointer.
*    *context - context for the call-back function.
*     mode
*     * CY_SYSPM_CHECK_READY - no action for this state.
*     * CY_SYSPM_CHECK_FAIL - no action for this state.
*     * CY_SYSPM_BEFORE_TRANSITION -
*     * CY_SYSPM_AFTER_TRANSITION -
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_SleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);

/*******************************************************************************
* Function Name: Cy_GFXSS_DeepSleepCallback
****************************************************************************//**
*
* Initializes graphics pipeline
*
* \param *callbackParams
*     A \ref cy_stc_syspm_callback_params_t structure with callback
*     parameters that consists of mode, base and context fields:
*    *base - a graphics register structure pointer.
*    *context - context for the call-back function.
*     mode
*     * CY_SYSPM_CHECK_READY - no action for this state.
*     * CY_SYSPM_CHECK_FAIL - no action for this state.
*     * CY_SYSPM_BEFORE_TRANSITION -
*     * CY_SYSPM_AFTER_TRANSITION -
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_GFXSS_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);

/*******************************************************************************
* Function Name: Cy_GFXSS_Interrupt
****************************************************************************//**
*
* The Interrupt Service Routine for the Graphics sub sytem.
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param context
* context information used by the driver.
*
*******************************************************************************/
void Cy_GFXSS_Interrupt(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Clear_DC_Interrupt
****************************************************************************//**
*
* The Interrupt Service Routine to clear Display Controller interrupts
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param context
* context information used by the driver.
*
*******************************************************************************/
void Cy_GFXSS_Clear_DC_Interrupt(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Clear_GPU_Interrupt
****************************************************************************//**
*
* The Interrupt Service Routine to clear GPU interrupts
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param context
* context information used by the driver.
*
*******************************************************************************/
void Cy_GFXSS_Clear_GPU_Interrupt(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Get_DC_Interrupt_Status
****************************************************************************//**
*
* Gets Display Controller interrupt status.
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \return Returns a word with bits set at positions corresponding to the
* interrupts triggered in the display controller.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_GFXSS_Get_DC_Interrupt_Status(GFXSS_Type *base);

/*******************************************************************************
* Function Name: Cy_GFXSS_Get_GPU_Interrupt_Status
****************************************************************************//**
*
* Gets GPU interrupt status.
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \return Returns a word with bits set at positions corresponding to the
* interrupts triggered in the GPU.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_GFXSS_Get_GPU_Interrupt_Status(GFXSS_Type *base);

