PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.h
/*******************************************************************************
* Function Name: Cy_GFXSS_Get_RLAD_Status
****************************************************************************//**
*
* Gets RLAD decoder status within Display Controller
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \return Returns \ref cy_en_gfx_rlad_status_t indicating decoder status.
*
*******************************************************************************/
__STATIC_INLINE cy_en_gfx_rlad_status_t Cy_GFXSS_Get_RLAD_Status(GFXSS_Type *base);

/*******************************************************************************
* Function Name: Cy_GFXSS_Set_FrameBuffer
****************************************************************************//**
*
* Sets Video/Graphics layer buffer address
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param gfx_layer_buffer
* Pointer to the frame buffer address to be used by Display Controller for transferring frame.
*
* \param context
* Pointer to the graphics config structure base address.
*
* \return
* CY_GFX_SUCCESS/CY_GFX_BAD_PARAM
*
* \note Framebuffer base address and stride for linear data should be
*       128-byte aligned.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Set_FrameBuffer(GFXSS_Type *base, uint32_t* gfx_layer_buffer, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Set_FrameBuffer_YUV
****************************************************************************//**
*
* Sets Video/Graphics layer YUV buffer addresses.
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param y_buffer
* Pointer to the Y buffer address to be used by Display Controller for transferring frame.
*
* \param uv_buffer
* Pointer to the UV buffer address to be used by Display Controller for transferring frame.
*
* \param context
* Pointer to the graphics config structure base address.
*
* \return
* CY_GFX_SUCCESS/CY_GFX_BAD_PARAM
*
* \note YUV Framebuffer base address and stride for linear data should be
*       64-byte aligned.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Set_FrameBuffer_YUV(GFXSS_Type *base, uint32_t* y_buffer, uint32_t* uv_buffer, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Get_FrameBufferAddress
****************************************************************************//**
*
* Gets the video/graphics layer buffer address used for transferring frame through Display Controller.
*
* \return
* frame buffer address.
*
*******************************************************************************/
uint32_t *Cy_GFXSS_Get_FrameBufferAddress(GFXSS_Type *base);

/*******************************************************************************
* Function Name: Cy_GFXSS_Set_Overlay0
****************************************************************************//**
*
* Sets Overlay0 buffer address
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param overlay0_buffer
* Pointer to the overlay0 buffer address to be used by Display Controller for transferring frame.
*
* \param context
* Pointer to the graphics config structure base address.
*
* \return
* CY_GFX_SUCCESS/CY_GFX_BAD_PARAM
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Set_Overlay0(GFXSS_Type *base, uint32_t* overlay0_buffer, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Set_Overlay0_YUV
****************************************************************************//**
*
* Sets Overlay0 YUV buffer addresses
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param y_buffer
* Pointer to the Y buffer address to be used by Display Controller for transferring frame.
*
* \param uv_buffer
* Pointer to the UV buffer address to be used by Display Controller for transferring frame.
*
* \param context
* Pointer to the graphics config structure base address.
*
* \return
* CY_GFX_SUCCESS/CY_GFX_BAD_PARAM
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Set_Overlay0_YUV(GFXSS_Type *base, uint32_t* y_buffer, uint32_t* uv_buffer, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Set_Overaly1
****************************************************************************//**
*
* Sets Overlay1 buffer address
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param overlay1_buffer
* Pointer to the overlay1 buffer address to be used by Display Controller for transferring frame.
*
* \param context
* Pointer to the graphics config structure base address.
*
* \return
* CY_GFX_SUCCESS/CY_GFX_BAD_PARAM
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Set_Overlay1(GFXSS_Type *base, uint32_t* overlay1_buffer, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_DeInit
****************************************************************************//**
*
* DeInitializes graphics pipeline
*
* \param base
* Holds the base address of the Graphics block registers.
*
* \param context
* context information used by the driver.
*
* \return
* SUCCESS/FAILURE.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_DeInit(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_RLAD_SetImage
****************************************************************************//**
*
* Set image configuration for RLAD.
*
* \param base
* Pointer to the graphics sub system base address.
*
* \param rlad_cfg
* Pointer to the RLAD configuration structure.
*
* \param context
* context information used by the driver.
*
* \return
* SUCESS/TIMEOUT status.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_RLAD_SetImage(GFXSS_Type *base,  cy_stc_gfx_rlad_cfg_t *rlad_cfg, cy_stc_gfx_context_t *context);

