PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.h
/*******************************************************************************
* Function Name: Cy_GFXSS_RLAD_Enable
****************************************************************************//**
*
* Enable RLAD in graphics pipeline.
*
* \param base
* Pointer to the graphics sub system base address.
*
* \param context
* context information used by the driver.
*
* \return
* SUCESS/FAILURE
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_RLAD_Enable(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_RLAD_Disable
****************************************************************************//**
*
* Disable RLAD in graphics pipeline.
*
* \param base
* Pointer to the graphics sub system base address.
*
* \param context
* context information used by the driver.
*
* \return
* Initialization status.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_RLAD_Disable(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Enable_GPU
****************************************************************************//**
*
* Enable GPU for composition.
*
* \param base
* Pointer to the graphics sub system base address.
*
* \param context
* context information used by the driver.
*
* \return
* SUCESS/TIMEOUT status.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Enable_GPU(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Disable_GPU
****************************************************************************//**
*
* Disable GPU and let Display controller refresh display based on already composed buffer stored in frame buffer address.
*
* \param base
* Pointer to the graphics sub system base address.
*
* \param context
* context information used by the driver.
*
* \return
* SUCESS/TIMEOUT status.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Disable_GPU(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Transfer_Frame
****************************************************************************//**
*
* Transfer frame to display in DBI command mode.
*
* \param base
* Pointer to the graphics sub system base address.
*
* \param context
* context information used by the driver.
*
* \return
* SUCESS/TIMEOUT status.
*
*******************************************************************************/
cy_en_gfx_status_t Cy_GFXSS_Transfer_Frame(GFXSS_Type *base, cy_stc_gfx_context_t *context);

/*******************************************************************************
* Function Name: Cy_GFXSS_Enable_GPU_Interrupt
****************************************************************************//**
*
* Enables GPU interrupt.
*
* \param base
* Pointer to the graphics sub system base address.
*
*
*******************************************************************************/
__STATIC_INLINE void Cy_GFXSS_Enable_GPU_Interrupt(GFXSS_Type *base)
{
    base->GFXSS_GPU.MXGPU.INTR_MASK |= GFXSS_GPU_MXGPU_INTR_MASK_CORE_MASK_Msk;
}

/*******************************************************************************
* Function Name: Cy_GFXSS_Disable_GPU_Interrupt
****************************************************************************//**
*
* Disables GPU interrupt.
*
* \param base
* Pointer to the graphics sub system base address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_GFXSS_Disable_GPU_Interrupt(GFXSS_Type *base)
{
    base->GFXSS_GPU.MXGPU.INTR_MASK &= ~GFXSS_GPU_MXGPU_INTR_MASK_CORE_MASK_Msk;
}

__STATIC_INLINE uint32_t Cy_GFXSS_Get_DC_Interrupt_Status(GFXSS_Type *base)
{
    return base->GFXSS_DC.MXDC.INTR;
}
__STATIC_INLINE uint32_t Cy_GFXSS_Get_GPU_Interrupt_Status(GFXSS_Type *base)
{
    return base->GFXSS_GPU.MXGPU.INTR;
}
__STATIC_INLINE cy_en_gfx_rlad_status_t Cy_GFXSS_Get_RLAD_Status(GFXSS_Type *base)
{
    return ((cy_en_gfx_rlad_status_t) _FLD2VAL(GFXSS_DC_MXDC_RLAD_STATUS_RLAD_FAILED, base->GFXSS_DC.MXDC.RLAD_STATUS));
}


/** \} group_graphics_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22GFXSS */

/** \} group_graphics */



#endif /* CY_GRAPHICS_H */

/* [] END OF FILE */
